Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: This hash is basically the center of every L<Mojolicious> application, you will learn more about this later on.
ja: This hash is basically the center of every [[Mojolicious]] application, you will learn more about this later on.

source: This is a significantly faster alternative to L</"tag"> for template systems that have to generate a lot of tags.
ja: This is a significantly faster alternative to [[/"tag"]] for template systems that have to generate a lot of tags.

source: This is only the first of the L<Mojolicious::Guides>.
ja: チュートリアルは[[Mojolicious::Guides]]の序章です。

source: This is the class hierarchy of the L<Mojolicious> distribution.
ja: This is the class hierarchy of the [[Mojolicious]] distribution.

source: This is the directory it will search for C<public> and C<templates> directories, but you can use it to store all sorts of application specific data.
ja: ホームディレクトリは、アプリケーションがpublic, templatesディレクトリを検索する場所です。ここにあらゆる種類のアプリケーションデータを保存することもできます。

source: This is the heart of every full L<Mojolicious> application and always gets instantiated during server startup.
ja: This is the heart of every full [[Mojolicious]] application and always gets instantiated during server startup.

source: This method will be called by L<Mojolicious::Plugins> at startup time.
ja: This method will be called by [[Mojolicious::Plugins]] at startup time.

source: This object initializes a L<Mojo::UserAgent> object and provides a variety of test assertion methods for accessing a web application.
ja: This object initializes a [[Mojo::UserAgent]] object and provides a variety of test assertion methods for accessing a web application.

source: This object initializes a L<Mojo::UserAgent> object, loads the Mojolicious application C<Frogs>, binds and listens on a free TCP port (e.g., 32114), and starts the application event loop.
ja: This object initializes a [[Mojo::UserAgent]] object, loads the Mojolicious application C<Frogs>, binds and listens on a free TCP port (e.g., 32114), and starts the application event loop.

source: This second invocation will load the application again, detect the process id file with it, and send a L</"USR2"> signal to the already running server.
ja: This second invocation will load the application again, detect the process id file with it, and send a [[/"USR2"]] signal to the already running server.

source: This section describes some complex (but common) testing situations that L<Test::Mojo> excels in making simple.
ja: This section describes some complex (but common) testing situations that [[Test::Mojo]] excels in making simple.

source: This section describes the basic test assertions supplied by L<Test::Mojo>.
ja: This section describes the basic test assertions supplied by [[Test::Mojo]].

source: This selector is part of L<Selectors Level 4|http://dev.w3.org/csswg/selectors-4>, which is still a work in progress.
ja: This selector is part of [[Selectors Level 4|http://dev.w3.org/csswg/selectors-4]], which is still a work in progress.

source: This statefulness also enables L<Test::Mojo> to handle sessions, follow redirects, and inspect past responses during a redirect.
ja: This statefulness also enables [[Test::Mojo]] to handle sessions, follow redirects, and inspect past responses during a redirect.

source: This timeout defaults to C<30> seconds and can be extended with the attribute L<Mojo::Server::Prefork/"heartbeat_timeout"> if your application requires it.
ja: This timeout defaults to C<30> seconds and can be extended with the attribute [[Mojo::Server::Prefork/"heartbeat_timeout"]] if your application requires it.

source: Timers, another primary feature of the event loop, are created with L<Mojo::IOLoop/"timer"> and can, for example, be used to delay rendering of a response, and unlike C<sleep>, won't block any other requests that might be processed concurrently.
ja: Timers, another primary feature of the event loop, are created with [[Mojo::IOLoop/"timer"]] and can, for example, be used to delay rendering of a response, and unlike C<sleep>, won't block any other requests that might be processed concurrently.

source: To build HTML forms more efficiently, you can also use tag helpers like L<Mojolicious::Plugin::TagHelpers/"form_for">.
ja: HTMLフォームを効率的に構築するために、 [[Mojolicious::Plugin::TagHelpers]]のC<form_for>のような タグヘルパーを使うこともできます。

source: To build HTML forms more efficiently you can use tag helpers like L<Mojolicious::Plugin::TagHelpers/"form_for">, which can automatically select a request method for you if a route name is provided.
ja: To build HTML forms more efficiently you can use tag helpers like [[Mojolicious::Plugin::TagHelpers/"form_for"]], which can automatically select a request method for you if a route name is provided.

source: To change MIME type mappings for the C<Accept> request header or the C<Content-Type> response header you can use L<Mojolicious/"types">.
ja: To change MIME type mappings for the C<Accept> request header or the C<Content-Type> response header you can use [[Mojolicious/"types"]].

source: To check or get the name of the current route you can use the helper L<Mojolicious::Plugin::DefaultHelpers/"current_route">.
ja: To check or get the name of the current route you can use the helper [[Mojolicious::Plugin::DefaultHelpers/"current_route"]].

source: To create a bare L<Test::Mojo> object:
ja: To create a bare [[Test::Mojo]] object:

source: To end the stream you can call L<Mojolicious::Controller/"finish"> or write an empty chunk of data.
ja: To end the stream you can call [[Mojolicious::Controller/"finish"]] or write an empty chunk of data.

source: To make route generation more expressive, you can also add your own shortcuts with L<Mojolicious::Routes/"add_shortcut">.
ja: To make route generation more expressive, you can also add your own shortcuts with [[Mojolicious::Routes/"add_shortcut"]].

source: To manage L<Hypnotoad|Mojo::Server::Hypnotoad> with systemd, you can use a unit configuration file like this.
ja: To manage [[Hypnotoad|Mojo::Server::Hypnotoad]] with systemd, you can use a unit configuration file like this.

source: To protect you from excessively large files there is also a limit of 16MiB by default, which you can tweak with the attribute L<Mojolicious/"max_request_size">.
ja: 極端に大きなファイルから保護するために、デフォルトでC<16MB>の制限があります。サイズは[[Mojolicious]]のC<max_request_size> 属性で変更できます。

source: To protect you from excessively large files there is also a limit of 2GiB by default, which you can tweak with the attribute L<Mojo::UserAgent/"max_response_size">.
ja: To protect you from excessively large files there is also a limit of 2GiB by default, which you can tweak with the attribute [[Mojo::UserAgent/"max_response_size"]].

source: To separate them from the surrounding text, you can surround your placeholders with C<E<lt>> and C<E<gt>>, which also makes the colon prefix optional.
ja: プレースホルダーを周囲の文字列と区別するためには、 C<E<lt>> と C<E<gt>> で囲みます。こうした場合、プレフィックスのコロンはオプションになります。

source: To set a C<layout> stash value application-wide you can use L<Mojolicious/"defaults">.
ja: To set a C<layout> stash value application-wide you can use [[Mojolicious/"defaults"]].

source: To share code with multiple nested routes you can use L<Mojolicious::Routes::Route/"under">, because unlike normal nested routes, the routes generated with it have their own intermediate destination and result in additional dispatch cycles when they match.
ja: To share code with multiple nested routes you can use [[Mojolicious::Routes::Route/"under"]], because unlike normal nested routes, the routes generated with it have their own intermediate destination and result in additional dispatch cycles when they match.

source: To solve these problems, you can configure your reverse proxy to send the missing data (see L</Nginx> and L</"Apache/mod_proxy">) and tell your application about it by setting the environment variable C<MOJO_REVERSE_PROXY>.
ja: To solve these problems, you can configure your reverse proxy to send the missing data (see [[/Nginx]] and [[/"Apache/mod_proxy"]]) and tell your application about it by setting the environment variable C<MOJO_REVERSE_PROXY>.

source: To start applications with it you can use the L<hypnotoad> script, which listens on port C<8080>, automatically daemonizes the server process and defaults to C<production> mode for L<Mojolicious> and L<Mojolicious::Lite> applications.
ja: To start applications with it you can use the [[hypnotoad]] script, which listens on port C<8080>, automatically daemonizes the server process and defaults to C<production> mode for [[Mojolicious> and [[Mojolicious::Lite]] applications.

source: To start applications with it you can use the L<morbo> script.
ja: To start applications with it you can use the [[morbo]] script.

source: To test this new feature, we don't even need to create a configuration file—we can simply pass the configuration data to the application directly via L<Test::Mojo>'s constructor:
ja: To test this new feature, we don't even need to create a configuration file—we can simply pass the configuration data to the application directly via [[Test::Mojo]]'s constructor:

source: Transaction builder, defaults to a L<Mojo::UserAgent::Transactor> object.
ja: Transaction builder, defaults to a [[Mojo::UserAgent::Transactor]] object.

source: Transparent CGI and L<PSGI> support out of the box.
ja: Transparent CGI and [[PSGI]] support out of the box.

source: Trim whitespace characters from both ends of bytestream with L<Mojo::Util/"trim">.
ja: Trim whitespace characters from both ends of bytestream with [[Mojo::Util/"trim"]].

source: Trim whitespace characters from both ends of string value with L<Mojo::Util/"trim">.
ja: Trim whitespace characters from both ends of string value with [[Mojo::Util/"trim"]].

source: True if L<IO::Socket::SOCKS> 0.64+ is installed and SOCKS5 support enabled.
ja: True if [[IO::Socket::SOCKS]] 0.64+ is installed and SOCKS5 support enabled.

source: True if L<IO::Socket::SSL> 2.009+ is installed and TLS support enabled.
ja: True if [[IO::Socket::SSL]] 2.009+ is installed and TLS support enabled.

source: True if L<Net::DNS::Native> 0.15+ is installed and non-blocking name resolution support enabled.
ja: True if [[Net::DNS::Native]] 0.15+ is installed and non-blocking name resolution support enabled.

source: True, this is a L<Mojo::Asset::File> object.
ja: True, this is a [[Mojo::Asset::File]] object.

source: True, this is a L<Mojo::Content::MultiPart> object.
ja: True, this is a [[Mojo::Content::MultiPart]] object.

source: True, this is a L<Mojo::Transaction::WebSocket> object.
ja: True, this is a [[Mojo::Transaction::WebSocket]] object.

source: Try to detect if content size exceeds L</"max_memory_size"> limit and automatically upgrade to a L<Mojo::Asset::File> object.
ja: Try to detect if content size exceeds [[/"max_memory_size"]] limit and automatically upgrade to a [[Mojo::Asset::File]] object.

source: Try to detect multipart content and automatically upgrade to a L<Mojo::Content::MultiPart> object, defaults to a true value.
ja: Try to detect multipart content and automatically upgrade to a [[Mojo::Content::MultiPart]] object, defaults to a true value.

source: Try to render content and return it wrapped in a L<Mojo::ByteStream> object or return C<undef>, all arguments get localized automatically and are only available during this render operation, takes the same arguments as L</"render">.
ja: Try to render content and return it wrapped in a [[Mojo::ByteStream]] object or return C<undef>, all arguments get localized automatically and are only available during this render operation, takes the same arguments as [[/"render"]].

source: Try to render content, but do not call L<Mojolicious::Plugin::DefaultHelpers/"reply-E<gt>not_found"> if no response could be generated, all arguments get localized automatically and are only available during this render operation, takes the same arguments as L</"render">.
ja: Try to render content, but do not call [[Mojolicious::Plugin::DefaultHelpers/"reply-E<gt]]not_found"]] if no response could be generated, all arguments get localized automatically and are only available during this render operation, takes the same arguments as [[/"render"]].

source: Turn L<Mojolicious> application into L<PSGI> application.
ja: Turn [[Mojolicious]] application into [[PSGI]] application.

source: Turn bytestream into L<Mojo::Collection> object containing L<Mojo::ByteStream> objects.
ja: Turn bytestream into [[Mojo::Collection]] object containing [[Mojo::ByteStream]] objects.

source: Turn collection into L<Mojo::ByteStream>.
ja: Turn collection into [[Mojo::ByteStream]].

source: Turn list into a L<Mojo::Collection> object.
ja: Turn list into a [[Mojo::Collection]] object.

source: Turn string into a L<Mojo::ByteStream> object.
ja: Turn string into a [[Mojo::ByteStream]] object.

source: Uncompress bytes with L<IO::Compress::Gunzip>.
ja: Uncompress bytes with [[IO::Compress::Gunzip]].

source: Uncompress bytestream with L<Mojo::Util/"gunzip">.
ja: Uncompress bytestream with [[Mojo::Util/"gunzip"]].

source: Under the hood, L<Test::Mojo> creates a new L<Mojo::Server> instance, loads C<MyApp> (which we just created), and runs the application.
ja: Under the hood, [[Test::Mojo]] creates a new [[Mojo::Server]] instance, loads C<MyApp> (which we just created), and runs the application.

source: Unescape all HTML entities in bytestream with L<Mojo::Util/"html_unescape">.
ja: Unescape all HTML entities in bytestream with [[Mojo::Util/"html_unescape"]].

source: Unindent bytestream with L<Mojo::Util/"unindent">.
ja: Unindent bytestream with [[Mojo::Util/"unindent"]].

source: Unquote bytestream with L<Mojo::Util/"unquote">.
ja: Unquote bytestream with [[Mojo::Util/"unquote"]].

source: Use L<Mojo::IOLoop/"stream"> to find the current connection and increase timeout if possible.
ja: Use [[Mojo::IOLoop/"stream"]] to find the current connection and increase timeout if possible.

source: Use L<Mojolicious::Command::Author::cpanify> for uploading files to CPAN.
ja: Use [[Mojolicious::Command::Author::cpanify]] for uploading files to CPAN.

source: Use L<Mojolicious::Command::Author::generate::app> to generate application directory structure for a fully functional L<Mojolicious> application.
ja: Use [[Mojolicious::Command::Author::generate::app]] to generate application directory structure for a fully functional [[Mojolicious]] application.

source: Use L<Mojolicious::Command::Author::generate::lite_app> to generate a fully functional L<Mojolicious::Lite> application.
ja: Use [[Mojolicious::Command::Author::generate::lite_app]] to generate a fully functional [[Mojolicious::Lite]] application.

source: Use L<Mojolicious::Command::Author::generate::makefile> to generate C<Makefile.PL> file for application.
ja: Use [[Mojolicious::Command::Author::generate::makefile]] to generate C<Makefile.PL> file for application.

source: Use L<Mojolicious::Command::Author::generate::plugin> to generate directory structure for a fully functional L<Mojolicious> plugin.
ja: Use [[Mojolicious::Command::Author::generate::plugin]] to generate directory structure for a fully functional [[Mojolicious]] plugin.

source: Use L<Mojolicious::Command::Author::inflate> to turn templates and static files embedded in the C<DATA> sections of your application into real files.
ja: Use [[Mojolicious::Command::Author::inflate]] to turn templates and static files embedded in the C<DATA> sections of your application into real files.

source: Use L<Mojolicious::Command::cgi> to start application with CGI backend, usually auto detected.
ja: Use [[Mojolicious::Command::cgi]] to start application with CGI backend, usually auto detected.

source: Use L<Mojolicious::Command::daemon> to start application with standalone HTTP and WebSocket server.
ja: Use [[Mojolicious::Command::daemon]] to start application with standalone HTTP and WebSocket server.

source: Use L<Mojolicious::Command::eval> to run code against application.
ja: Use [[Mojolicious::Command::eval]] to run code against application.

source: Use L<Mojolicious::Command::get> to perform requests to remote host or local application.
ja: Use [[Mojolicious::Command::get]] to perform requests to remote host or local application.

source: Use L<Mojolicious::Command::prefork> to start application with standalone pre-forking HTTP and WebSocket server.
ja: Use [[Mojolicious::Command::prefork]] to start application with standalone pre-forking HTTP and WebSocket server.

source: Use L<Mojolicious::Command::psgi> to start application with PSGI backend, usually auto detected.
ja: Use [[Mojolicious::Command::psgi]] to start application with PSGI backend, usually auto detected.

source: Use L<Mojolicious::Command::routes> to list application routes.
ja: Use [[Mojolicious::Command::routes]] to list application routes.

source: Use L<Mojolicious::Command::version> to show version information for available core and optional modules, very useful for debugging.
ja: Use [[Mojolicious::Command::version]] to show version information for available core and optional modules, very useful for debugging.

source: Use an already prepared L<IO::Socket::IP> object.
ja: Use an already prepared [[IO::Socket::IP]] object.

source: Used to render content, defaults to a L<Mojolicious::Renderer> object.
ja: Used to render content, defaults to a [[Mojolicious::Renderer]] object.

source: User agent used for testing, defaults to a L<Mojo::UserAgent> object.
ja: User agent used for testing, defaults to a [[Mojo::UserAgent]] object.

source: Username part of L</"userinfo">.
ja: Username part of [[/"userinfo"]].

source: Validate values, defaults to a L<Mojolicious::Validator> object.
ja: Validate values, defaults to a [[Mojolicious::Validator]] object.

source: Validation checks can be registered with L<Mojolicious::Validator/"add_check"> and return a false value if they were successful.
ja: Validation checks can be registered with [[Mojolicious::Validator/"add_check"]] and return a false value if they were successful.

source: Value needs to be a L<Mojo::Upload> object, representing a file upload.
ja: Value needs to be a [[Mojo::Upload]] object, representing a file upload.

source: Versatile L<Mojo::Transaction::HTTP> transaction builder for WebSocket handshake requests.
ja: Versatile [[Mojo::Transaction::HTTP]] transaction builder for WebSocket handshake requests.

source: Versatile general purpose L<Mojo::Transaction::HTTP> transaction builder for requests, with support for L</"GENERATORS">.
ja: Versatile general purpose [[Mojo::Transaction::HTTP]] transaction builder for requests, with support for [[/"GENERATORS"]].

source: We wrap that in the C<success> attribute, which records the boolean test result and propagates the L<Test::Mojo> object for method chaining.
ja: We wrap that in the C<success> attribute, which records the boolean test result and propagates the [[Test::Mojo]] object for method chaining.

source: We are optimizing L<Mojolicious> for user-friendliness and development speed, without compromises.
ja: We are optimizing [[Mojolicious]] for user-friendliness and development speed, without compromises.

source: We assign a default description value (C<$desc>), set the L<Test::Builder> C<Level> global variable one level higher (which tells L<Test::Builder> how far up the call stack to look when something fails), then we use L<Test::More>'s C<is> function to compare the location header with the expected header value.
ja: We assign a default description value (C<$desc>), set the [[Test::Builder]] C<Level> global variable one level higher (which tells [[Test::Builder]] how far up the call stack to look when something fails), then we use [[Test::More]]'s C<is> function to compare the location header with the expected header value.

source: We can test the application by creating a L<Mojo::Transaction> object, setting the cookie (see L<Mojo::Message::Request>), then passing the transaction object to C<request_ok>:
ja: We can test the application by creating a [[Mojo::Transaction]] object, setting the cookie (see [[Mojo::Message::Request]]), then passing the transaction object to C<request_ok>:

source: We can also inspect HTML and XML responses using the L<Mojo::DOM> parser in the user agent.
ja: We can also inspect HTML and XML responses using the [[Mojo::DOM]] parser in the user agent.

source: We can also inspect cookies in responses for special values through the transaction's response (L<Mojo::Message::Response>) object:
ja: We can also inspect cookies in responses for special values through the transaction's response ([[Mojo::Message::Response]]) object:

source: We can tell the user agent in L<Test::Mojo> how to deal with redirects.
ja: We can tell the user agent in [[Test::Mojo]] how to deal with redirects.

source: We can use L<Test::Mojo> to test applications that keep session state in cookies.
ja: We can use [[Test::Mojo]] to test applications that keep session state in cookies.

source: We differentiate between default helpers, which are more general purpose like L<Mojolicious::Plugin::DefaultHelpers/"dumper">, and tag helpers like L<Mojolicious::Plugin::TagHelpers/"link_to">, which are template specific and mostly used to generate HTML tags.
ja: We differentiate between default helpers, which are more general purpose like [[Mojolicious::Plugin::DefaultHelpers/"dumper"]], and tag helpers like [[Mojolicious::Plugin::TagHelpers/"link_to"]], which are template specific and mostly used to generate HTML tags.

source: We use the L<GitHub issue tracker|https://github.com/mojolicious/mojo/issues>, so you'll need to create a (free) GitHub account to be able to submit issues, comments and pull requests.
ja: We use the [[GitHub issue tracker|https://github.com/mojolicious/mojo/issues]], so you'll need to create a (free) GitHub account to be able to submit issues, comments and pull requests.

source: We will start by extracting all actions from C<myapp.pl> and turn them into simplified hybrid routes in the L<Mojolicious::Routes> router, none of the actual action code needs to be changed.
ja: We will start by extracting all actions from C<myapp.pl> and turn them into simplified hybrid routes in the [[Mojolicious::Routes]] router, none of the actual action code needs to be changed.

source: We write our tests with relative URLs because L<Test::Mojo> takes care of getting the request to the running test application (since its port may change between runs).
ja: We write our tests with relative URLs because [[Test::Mojo]] takes care of getting the request to the running test application (since its port may change between runs).

source: We'd love to discuss your contributions to L<Mojolicious> on our official IRC channel C<#mojo> on C<irc.freenode.net> (L<chat now!|https://kiwiirc.com/nextclient/#irc://irc.freenode.net/mojo?nick=guest-?>).
ja: We'd love to discuss your contributions to [[Mojolicious]] on our official IRC channel C<#mojo> on C<irc.freenode.net> (L<chat now!|https://kiwiirc.com/nextclient/#irc://irc.freenode.net/mojo?nick=guest-?>).

source: We'll create a new class with L<Role::Tiny> that implements a test assertion named C<location_is>:
ja: We'll create a new class with [[Role::Tiny]] that implements a test assertion named C<location_is>:

source: Weaken attribute reference to avoid L<circular references|perlref/"Circular-References"> and memory leaks.
ja: Weaken attribute reference to avoid [[circular references|perlref/"Circular-References"]] and memory leaks.

source: WebSocket applications have never been this simple before.
ja: WebSocketアプリケーションはこれまでに見たこともないくらい簡単です。

source: WebSocket test assertions are covered in L</Testing WebSocket web services>.
ja: WebSocket test assertions are covered in [[/Testing WebSocket web services]].
